Revit 2027 API
BuiltInFailures.SketchFailures.ManyDirectionCurvesError Property
 More than one direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ManyDirectionCurvesError { get; }
Public Shared ReadOnly Property ManyDirectionCurvesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ManyDirectionCurvesError {
	FailureDefinitionId^ get ();
}
static member ManyDirectionCurvesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace